//sven_JOB      JOB (ACCT#),'NAME',CLASS=A,MSGCLASS=A
//sven_STEP1    EXEC PGM=MYPROGRAM
//sven_INPUT    DD   DSN=MY.INPUT.FILE,DISP=SHR
//sven_OUTPUT   DD   DSN=MY.OUTPUT.FILE,DISP=NEW